---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.BackgroundTaskCancelledException
source: html/19bd3f8f-e742-a821-5833-cef2d39057b1.htm
---
# BackgroundTaskCancelledException Methods

Retrieves data needed to serialize the target object.